# Вычислить число Пи c заданной точностью d
#
# Пример:
#
#     - при d = 0.0001,  π = 3.1415    10^-1 ≤ d ≤10^-10

def findePi(d):
    PI = "3.141592653589793238462643383279"
    return PI[:len(d)]

d = input("Введите точность числа пи (d = 0.0001) ")

print(findePi(d))